## Terraform plan (envs/dev)\n\n<details>\n<summary>Plan summary</summary>\n\n<pre>\ncreate:  41\nupdate:  0\ndelete:  0\nreplace: 0\nread:    3\nno_op:   0\n</pre>\n</details>\n\n<details>\n<summary>Full plan</summary>\n\n<pre>
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 &lt;= read (data resources)

Terraform will perform the following actions:

  # aws_eip.nat will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + region               = "eu-west-2"
      + tags                 = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-26-12-29-34-nat-eip"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all             = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-26-12-29-34-nat-eip"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
    }

  # aws_nat_gateway.this will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + auto_provision_zones               = (known after apply)
      + auto_scaling_ips                   = (known after apply)
      + availability_mode                  = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + region                             = "eu-west-2"
      + regional_nat_gateway_address       = (known after apply)
      + regional_nat_gateway_auto_mode     = (known after apply)
      + route_table_id                     = (known after apply)
      + secondary_allocation_ids           = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-26-12-29-34-nat"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all                           = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-26-12-29-34-nat"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + vpc_id                             = (known after apply)
    }

  # module.compute[0].aws_instance.app will be created
  + resource "aws_instance" "app" {
      + ami                                  = "ami-0a0ff88d0f3f85a14"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + force_destroy                        = false
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_group_id                   = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + region                               = "eu-west-2"
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-app"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all                             = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-app"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tenancy                              = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + primary_network_interface {
          + delete_on_termination = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options (known after apply)

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 20
          + volume_type           = "gp3"
        }
    }

  # module.compute[0].aws_network_interface.instance will be created
  + resource "aws_network_interface" "instance" {
      + arn                       = (known after apply)
      + description               = "Golden Path dev instance"
      + enable_primary_ipv6       = (known after apply)
      + id                        = (known after apply)
      + interface_type            = (known after apply)
      + ipv4_prefix_count         = (known after apply)
      + ipv4_prefixes             = (known after apply)
      + ipv6_address_count        = (known after apply)
      + ipv6_address_list         = (known after apply)
      + ipv6_address_list_enabled = false
      + ipv6_addresses            = (known after apply)
      + ipv6_prefix_count         = (known after apply)
      + ipv6_prefixes             = (known after apply)
      + mac_address               = (known after apply)
      + outpost_arn               = (known after apply)
      + owner_id                  = (known after apply)
      + private_dns_name          = (known after apply)
      + private_ip                = (known after apply)
      + private_ip_list           = (known after apply)
      + private_ip_list_enabled   = false
      + private_ips               = (known after apply)
      + private_ips_count         = (known after apply)
      + region                    = "eu-west-2"
      + security_groups           = (known after apply)
      + source_dest_check         = true
      + subnet_id                 = (known after apply)
      + tags                      = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-app-eni"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all                  = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-app-eni"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }

      + attachment (known after apply)
    }

  # module.eks[0].data.tls_certificate.oidc will be read during apply
  # (config refers to values not yet known)
 &lt;= data "tls_certificate" "oidc" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks[0].aws_eks_addon.coredns will be created
  + resource "aws_eks_addon" "coredns" {
      + addon_name                  = "coredns"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "goldenpath-dev-eks-26-12-29-34"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + region                      = "eu-west-2"
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-26-12-29-34-coredns"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all                    = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-26-12-29-34-coredns"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
    }

  # module.eks[0].aws_eks_addon.kube_proxy will be created
  + resource "aws_eks_addon" "kube_proxy" {
      + addon_name                  = "kube-proxy"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "goldenpath-dev-eks-26-12-29-34"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + region                      = "eu-west-2"
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-26-12-29-34-kube-proxy"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all                    = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-26-12-29-34-kube-proxy"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
    }

  # module.eks[0].aws_eks_addon.vpc_cni will be created
  + resource "aws_eks_addon" "vpc_cni" {
      + addon_name                  = "vpc-cni"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "goldenpath-dev-eks-26-12-29-34"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + region                      = "eu-west-2"
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-26-12-29-34-vpc-cni"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all                    = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-26-12-29-34-vpc-cni"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
    }

  # module.eks[0].aws_eks_cluster.this will be created
  + resource "aws_eks_cluster" "this" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + deletion_protection           = (known after apply)
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "goldenpath-dev-eks-26-12-29-34"
      + platform_version              = (known after apply)
      + region                        = "eu-west-2"
      + role_arn                      = (known after apply)
      + status                        = (known after apply)
      + tags                          = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all                      = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + version                       = "1.29"

      + access_config {
          + authentication_mode                         = "API_AND_CONFIG_MAP"
          + bootstrap_cluster_creator_admin_permissions = true
        }

      + compute_config (known after apply)

      + control_plane_scaling_config (known after apply)

      + kubernetes_network_config (known after apply)

      + storage_config (known after apply)

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks[0].aws_eks_node_group.this will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "goldenpath-dev-eks-26-12-29-34"
      + disk_size              = 20
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.small",
        ]
      + node_group_name        = "dev-default"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + region                 = "eu-west-2"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all               = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + version                = (known after apply)

      + node_repair_config (known after apply)

      + scaling_config {
          + desired_size = 4
          + max_size     = 7
          + min_size     = 4
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # module.eks[0].aws_iam_openid_connect_provider.this will be created
  + resource "aws_iam_openid_connect_provider" "this" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-26-12-29-34-oidc-provider"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all        = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-26-12-29-34-oidc-provider"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks[0].aws_iam_role.cluster will be created
  + resource "aws_iam_role" "cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "goldenpath-dev-eks-26-12-29-34-cluster-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-26-12-29-34-cluster-role"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all              = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-26-12-29-34-cluster-role"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.eks[0].aws_iam_role.node_group will be created
  + resource "aws_iam_role" "node_group" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "goldenpath-dev-eks-26-12-29-34-node-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-26-12-29-34-node-role"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all              = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-26-12-29-34-node-role"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.eks[0].aws_iam_role_policy_attachment.cluster["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "cluster" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "goldenpath-dev-eks-26-12-29-34-cluster-role"
    }

  # module.eks[0].aws_iam_role_policy_attachment.cluster["arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"] will be created
  + resource "aws_iam_role_policy_attachment" "cluster" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "goldenpath-dev-eks-26-12-29-34-cluster-role"
    }

  # module.eks[0].aws_iam_role_policy_attachment.node_group["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "node_group" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "goldenpath-dev-eks-26-12-29-34-node-role"
    }

  # module.eks[0].aws_iam_role_policy_attachment.node_group["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "node_group" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "goldenpath-dev-eks-26-12-29-34-node-role"
    }

  # module.eks[0].aws_iam_role_policy_attachment.node_group["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"] will be created
  + resource "aws_iam_role_policy_attachment" "node_group" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "goldenpath-dev-eks-26-12-29-34-node-role"
    }

  # module.eks[0].aws_iam_role_policy_attachment.node_group["arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "node_group" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy"
      + role       = "goldenpath-dev-eks-26-12-29-34-node-role"
    }

  # module.eks[0].aws_security_group.cluster will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "Security group for EKS cluster control plane"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "goldenpath-dev-eks-26-12-29-34-cluster-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "eu-west-2"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-26-12-29-34-cluster-sg"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all               = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-26-12-29-34-cluster-sg"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + vpc_id                 = (known after apply)
    }

  # module.iam[0].data.aws_iam_policy_document.cluster_autoscaler_assume[0] will be read during apply
  # (config refers to values not yet known)
 &lt;= data "aws_iam_policy_document" "cluster_autoscaler_assume" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = (known after apply)
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:cluster-autoscaler",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.iam[0].data.aws_iam_policy_document.lb_controller_assume[0] will be read during apply
  # (config refers to values not yet known)
 &lt;= data "aws_iam_policy_document" "lb_controller_assume" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = (known after apply)
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:aws-load-balancer-controller",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.iam[0].aws_iam_role.cluster_autoscaler[0] will be created
  + resource "aws_iam_role" "cluster_autoscaler" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "goldenpath-idp-cluster-autoscaler-26-12-29-34"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all              = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam[0].aws_iam_role.eks_cluster will be created
  + resource "aws_iam_role" "eks_cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "goldenpath-dev-eks-cluster-role-26-12-29-34"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all              = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam[0].aws_iam_role.eks_node_group will be created
  + resource "aws_iam_role" "eks_node_group" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "goldenpath-dev-eks-node-role-26-12-29-34"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all              = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam[0].aws_iam_role.lb_controller[0] will be created
  + resource "aws_iam_role" "lb_controller" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "goldenpath-idp-aws-load-balancer-controller-26-12-29-34"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all              = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam[0].aws_iam_role_policy_attachment.cluster_autoscaler[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_autoscaler" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::593517239005:policy/golden-path-cluster-autoscaler-policy"
      + role       = "goldenpath-idp-cluster-autoscaler-26-12-29-34"
    }

  # module.iam[0].aws_iam_role_policy_attachment.eks_cluster_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_cluster_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "goldenpath-dev-eks-cluster-role-26-12-29-34"
    }

  # module.iam[0].aws_iam_role_policy_attachment.eks_vpc_resource_controller will be created
  + resource "aws_iam_role_policy_attachment" "eks_vpc_resource_controller" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "goldenpath-dev-eks-cluster-role-26-12-29-34"
    }

  # module.iam[0].aws_iam_role_policy_attachment.lb_controller[0] will be created
  + resource "aws_iam_role_policy_attachment" "lb_controller" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::593517239005:policy/goldenpath-load-balancer-controller-policy"
      + role       = "goldenpath-idp-aws-load-balancer-controller-26-12-29-34"
    }

  # module.private_route_table.aws_route_table.this will be created
  + resource "aws_route_table" "this" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "eu-west-2"
      + route            = [
          + {
              + cidr_block                 = (known after apply)
              + gateway_id                 = (known after apply)
              + nat_gateway_id             = (known after apply)
                # (10 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-26-12-29-34-private-rt"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all         = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-26-12-29-34-private-rt"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + vpc_id           = (known after apply)
    }

  # module.private_route_table.aws_route_table_association.this["0"] will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + region         = "eu-west-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.private_route_table.aws_route_table_association.this["1"] will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + region         = "eu-west-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.public_route_table.aws_route_table.this will be created
  + resource "aws_route_table" "this" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "eu-west-2"
      + route            = [
          + {
              + cidr_block                 = (known after apply)
              + gateway_id                 = (known after apply)
              + nat_gateway_id             = (known after apply)
                # (10 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-26-12-29-34-public-rt"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all         = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-26-12-29-34-public-rt"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + vpc_id           = (known after apply)
    }

  # module.public_route_table.aws_route_table_association.this["0"] will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + region         = "eu-west-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.public_route_table.aws_route_table_association.this["1"] will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + region         = "eu-west-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.subnets.aws_subnet.private["goldenpath-dev-private-a"] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "eu-west-2"
      + tags                                           = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-private-a"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
          + "Tier"        = "private"
        }
      + tags_all                                       = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-private-a"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
          + "Tier"        = "private"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.subnets.aws_subnet.private["goldenpath-dev-private-b"] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "eu-west-2"
      + tags                                           = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-private-b"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
          + "Tier"        = "private"
        }
      + tags_all                                       = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-private-b"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
          + "Tier"        = "private"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.subnets.aws_subnet.public["goldenpath-dev-public-a"] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "eu-west-2"
      + tags                                           = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-public-a"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
          + "Tier"        = "public"
        }
      + tags_all                                       = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-public-a"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
          + "Tier"        = "public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.subnets.aws_subnet.public["goldenpath-dev-public-b"] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "eu-west-2"
      + tags                                           = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-public-b"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
          + "Tier"        = "public"
        }
      + tags_all                                       = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-public-b"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
          + "Tier"        = "public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + region   = "eu-west-2"
      + tags     = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-26-12-29-34-vpc-igw"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-26-12-29-34-vpc-igw"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "eu-west-2"
      + route            = [
          + {
              + cidr_block                 = (known after apply)
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "public-route-table"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all         = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "public-route-table"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + region                               = "eu-west-2"
      + tags                                 = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-26-12-29-34-vpc"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all                             = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-26-12-29-34-vpc"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
    }

  # module.web_security_group.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTPS ingress"
              + from_port        = 443
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "goldenpath-dev-26-12-29-34-web-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "eu-west-2"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-26-12-29-34-web-sg"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all               = {
          + "BuildId"     = "26-12-29-34"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-26-12-29-34-web-sg"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + vpc_id                 = (known after apply)
    }

Plan: 41 to add, 0 to change, 0 to destroy.
</pre>\n</details>\n\n